In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame(np.random.randint(10,100,size=(20000,5)),
  columns=['s1','s2','s3','s4','s5'])

In [4]:
df.head()

   s1  s2  s3  s4  s5
0  69  49  89  55  92
1  21  55  61  72  50
2  39  85  35  86  61
3  98  51  18  48  56
4  76  14  36  78  33

In [9]:
df['obtained'] = df.loc[:,'s1':'s5'].apply(sum,axis=1)

In [10]:
df.head()

   s1  s2  s3  s4  s5  obtained
0  69  49  89  55  92       354
1  21  55  61  72  50       259
2  39  85  35  86  61       306
3  98  51  18  48  56       271
4  76  14  36  78  33       237

In [11]:
df['obtained'] = df.s1+df.s2+df.s3+df.s4+df.s5

In [12]:
df.head()

   s1  s2  s3  s4  s5  obtained
0  69  49  89  55  92       354
1  21  55  61  72  50       259
2  39  85  35  86  61       306
3  98  51  18  48  56       271
4  76  14  36  78  33       237

In [16]:
df['obtained']  =  df.loc[:,'s1':'s5'].apply(lambda x:np.sum(x),axis=1)

In [17]:
df.head()

   s1  s2  s3  s4  s5  obtained
0  69  49  89  55  92       354
1  21  55  61  72  50       259
2  39  85  35  86  61       306
3  98  51  18  48  56       271
4  76  14  36  78  33       237

In [19]:
def cals(*x):
  return np.sum(x)
  

df['obtained'] = df.loc[:,'s1':'s5'].apply(cals,axis=1)

In [20]:
df.head()

   s1  s2  s3  s4  s5  obtained
0  69  49  89  55  92       354
1  21  55  61  72  50       259
2  39  85  35  86  61       306
3  98  51  18  48  56       271
4  76  14  36  78  33       237

In [21]:
df['total'] = 500

In [22]:
df.head()

   s1  s2  s3  s4  s5  obtained  total
0  69  49  89  55  92       354    500
1  21  55  61  72  50       259    500
2  39  85  35  86  61       306    500
3  98  51  18  48  56       271    500
4  76  14  36  78  33       237    500

In [26]:
df['percentage'] = df.obtained/df.total *100

In [27]:
df.head()

   s1  s2  s3  s4  s5  obtained  total  percentage
0  69  49  89  55  92       354    500        70.8
1  21  55  61  72  50       259    500        51.8
2  39  85  35  86  61       306    500        61.2
3  98  51  18  48  56       271    500        54.2
4  76  14  36  78  33       237    500        47.4

In [29]:
def grade(x):
   if x>= 80:
    return "A+"
   elif x>= 70:
    return "B"
   elif x>= 60:
    return "B"
   elif x>= 50:
    return "C"
   elif x>= 40:
    return "D"
   elif x>= 33:
    return "E"
   else:
    return "FAIL"


df['grade'] = df.percentage.apply(grade)
df.head()

   s1  s2  s3  s4  s5  obtained  total  percentage grade
0  69  49  89  55  92       354    500        70.8     B
1  21  55  61  72  50       259    500        51.8     C
2  39  85  35  86  61       306    500        61.2     B
3  98  51  18  48  56       271    500        54.2     C
4  76  14  36  78  33       237    500        47.4     D

In [30]:
df.grade.value_counts()

C       6491
B       6166
D       4869
E       1580
FAIL     637
A+       257
Name: grade, dtype: int64

In [31]:
pd.get_dummies(df.grade)

       A+  B  C  D  E  FAIL
0       0  1  0  0  0     0
1       0  0  1  0  0     0
2       0  1  0  0  0     0
3       0  0  1  0  0     0
4       0  0  0  1  0     0
...    .. .. .. .. ..   ...
19995   0  0  0  0  1     0
19996   0  0  0  0  1     0
19997   0  0  0  0  1     0
19998   0  0  0  1  0     0
19999   0  0  0  1  0     0

[20000 rows x 6 columns]

In [36]:
X = df.loc[:,'s1':'s5']
Y = pd.get_dummies(df.grade)

In [37]:
X.head()

   s1  s2  s3  s4  s5
0  69  49  89  55  92
1  21  55  61  72  50
2  39  85  35  86  61
3  98  51  18  48  56
4  76  14  36  78  33

In [38]:
Y.head()

   A+  B  C  D  E  FAIL
0   0  1  0  0  0     0
1   0  0  1  0  0     0
2   0  1  0  0  0     0
3   0  0  1  0  0     0
4   0  0  0  1  0     0

In [39]:
X.shape

(20000, 5)

In [40]:
Y.shape

(20000, 6)

In [50]:
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense
from tensorflow.keras.optimizers import Adam, SGD





model = Sequential()            

model.add(Dense(5,input_shape=(5,),activation='relu'))      
model.add(Dense(6,activation='softmax')) #second layer

In [52]:
model.summary()

Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_4 (Dense)              (None, 5)                 30
_________________________________________________________________
dense_5 (Dense)              (None, 6)                 36
=================================================================
Total params: 66
Trainable params: 66
Non-trainable params: 0
_________________________________________________________________

In [53]:
model.compile(optimizer=SGD(lr=0.2), 
              loss='categorical_crossentropy',     
              metrics=['acc']
              )

In [55]:
model.fit(X,Y, epochs=10)

Epoch 1/10
625/625 [==============================] - 1s 1ms/step - loss: 1.4996 - acc: 0.3212
Epoch 2/10
625/625 [==============================] - 1s 1ms/step - loss: 1.4397 - acc: 0.3164
Epoch 3/10
625/625 [==============================] - 1s 1ms/step - loss: 1.4395 - acc: 0.3214
Epoch 4/10
625/625 [==============================] - 1s 1ms/step - loss: 1.4397 - acc: 0.3196
Epoch 5/10
625/625 [==============================] - 1s 1ms/step - loss: 1.4392 - acc: 0.3211
Epoch 6/10
625/625 [==============================] - 1s 1ms/step - loss: 1.4394 - acc: 0.3252
Epoch 7/10
625/625 [==============================] - 1s 1ms/step - loss: 1.4392 - acc: 0.3185
Epoch 8/10
625/625 [==============================] - 1s 1ms/step - loss: 1.4395 - acc: 0.3210
Epoch 9/10
625/625 [==============================] - 1s 1ms/step - loss: 1.4394 - acc: 0.3228
Epoch 10/10
625/625 [==============================] - 1s 1ms/step - loss: 1.4394 - acc: 0.3247

In [61]:
df['predict'] = Y.columns.take(np.argmax(model.predict(df.loc[:,'s1':'s5']),
    axis=1 ))

df.head(10)

   s1  s2  s3  s4  s5  obtained  total  percentage grade predict
0  69  49  89  55  92       354    500        70.8     B       B
1  21  55  61  72  50       259    500        51.8     C       B
2  39  85  35  86  61       306    500        61.2     B       B
3  98  51  18  48  56       271    500        54.2     C       B
4  76  14  36  78  33       237    500        47.4     D       B
5  22  78  81  17  56       254    500        50.8     C       B
6  73  18  51  38  91       271    500        54.2     C       B
7  31  25  46  40  57       199    500        39.8     E       B
8  63  94  70  27  32       286    500        57.2     C       B
9  33  54  14  81  84       266    500        53.2     C       B

In [62]:
df.predict.value_counts()

B    20000
Name: predict, dtype: int64